Tekla Open API Reference for Tekla Structures 2025
LineTypes.Custom Method
 The Custom line type defines a line that is drawn using one of the custom line types, as specified by the CustomLineTypeName.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static LineTypes Custom(
	string CustomLineTypeName
)
Public Shared Function Custom (
	CustomLineTypeName As String
) As LineTypes
Parameters
CustomLineTypeName
Type: System.String
A valid custom line type name, if it is not valid an exception will be thrown.
Return Value
Type: LineTypes
The requested custom line type.
Exceptions
Exception | Condition
TeklaStructuresDrawingsApplicationException | Thrown if an invalid custom line type name is given.
See Also
Reference
LineTypes Class
Tekla.Structures.Drawing Namespace